import React from "react";
import "./About.css";
import aboutImg from '../../Components/About/SVGRepo_iconCarrier.png'

export const About = () => {
  return (
    <div className="about-section">
      <h2 className="about-title">من نحن</h2>
      <div className="about-content">
        <div className="about-image">
          <div className="image-background">
            <p className="logo-text">
              برون<span className="orange-text">ز</span>
            </p>
            <img
              src={aboutImg}
              alt="متجر بروز"
              className="about-img"
            />
          </div>
        </div>

        <div className="about-text">
          <p>
            متجر بروز يوفر لك كل ما تحتاجه. هذا النص هو مثال لنص يمكن أن يستبدل
            في نفس المساحة. لقد تم توليد هذا النص من مولد النص العربي، حيث يمكنك
            أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد
            الحروف التي يولدها التطبيق. إذا كنت تحتاج إلى عدد أكبر من الفقرات
            يتيح لك مولد النص العربي زيادة عدد الفقرات كما تريد، النص لن يبدو
            مقسما ولا يحوي أخطاء لغوية، مولد النص العربي مفيد لمصممي المواقع على
            وجه الخصوص  متجر بروز يوفر لك كل ما تحتاجه. هذا النص هو مثال لنص يمكن أن يستبدل
            في نفس المساحة. لقد تم توليد هذا النص من مولد النص العربي، حيث يمكنك
            أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد
            الحروف التي يولدها التطبيق. إذا كنت تحتاج إلى عدد أكبر من الفقرات
            يتيح لك مولد النص العربي زيادة عدد الفقرات كما تريد، النص لن يبدو
            مقسما ولا يحوي أخطاء لغوية، مولد النص العربي مفيد.
          </p>
        </div>
      </div>
      <div className="about-text2">
        <p>
          إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربي زيادة
          عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء لغوية، مولد
          النص العربي مفيد لمصممي المواقع على وجه الخصوص.
        </p>
        <p className="about-text2">
            متجر بروز يوفر لك كل ما تحتاجه. هذا النص هو مثال لنص يمكن أن يستبدل
            في نفس المساحة. لقد تم توليد هذا النص من مولد النص العربي، حيث يمكنك
            أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد
            الحروف التي يولدها التطبيق. إذا كنت تحتاج إلى عدد أكبر من الفقرات
            يتيح لك مولد النص العربي زيادة عدد الفقرات كما تريد، النص لن يبدو
            مقسما ولا يحوي أخطاء لغوية، مولد النص العربي مفيد لمصممي المواقع على
            وجه الخصوص.
          </p>
      </div>
    </div>
  );
};
export default About;